cmsis-svd/cmsis-svd/data/Renesas/R7FA4E10D.svd
                <register>
                    <name>WUPEN0</name>
                    <description>Wake Up Interrupt Enable Register 0</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IRQWUPEN0</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN1</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN2</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN3</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN4</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN5</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN6</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN7</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN8</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN9</name>
                            <description>IRQn Interrupt Software Standby/Snooze Mode Returns Enable bit (n = 0 to 9)</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQn interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRQWUPEN13</name>
                            <description>IRQ13 Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IRQ13 interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IRQ13 interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IWDTWUPEN</name>
                            <description>IWDT Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by IWDT interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by IWDT interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1WUPEN</name>
                            <description>LVD1 Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by LVD1 interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by LVD1 interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD2WUPEN</name>
                            <description>LVD2 Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by LVD2 interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by LVD2 interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCALMWUPEN</name>
                            <description>RTC Alarm Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by RTC alarm interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by RTC alarm interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCPRDWUPEN</name>
                            <description>RTC Period Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by RTC period interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by RTC period interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USBFS0WUPEN</name>
                            <description>USBFS0 Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by USBFS0 interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by USBFS0 interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AGT1UDWUPEN</name>
                            <description>AGT1 Underflow Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by AGT1 underflow interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by AGT1 underflow interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AGT1CAWUPEN</name>
                            <description>AGT1 Compare Match A Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by AGT1 compare match A interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by AGT1 compare match A interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AGT1CBWUPEN</name>
                            <description>AGT1 Compare Match B Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Software Standby/Snooze Mode returns by AGT1 compare match B interrupt is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Software Standby/Snooze Mode returns by AGT1 compare match B interrupt is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IIC0WUPEN</name>
                            <description>IIC0 Address Match Interrupt Software Standby/Snooze Mode Returns Enable bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
