cmsis-svd/cmsis-svd/data/Renesas/R7FA4E10D.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CAN0</name>
            <description>Controller Area Network</description>
            <baseAddress>0x400A8000</baseAddress>
            <addressBlock>
                <offset>0x200</offset>
                <size>560</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x820</offset>
                <size>57</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_ID</name>
                    <description>Mailbox ID Register %s</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>Extended ID of data and remote frames</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>Standard ID of data and remote frames</description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>Remote Transmission Request</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>ID Extension</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Standard ID</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extended ID</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_DL</name>
                    <description>Mailbox Data Length Register %s</description>
                    <addressOffset>0x204</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>DLC</name>
                            <description>Data Length Code</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Data length = 0 byte</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1</name>
                                    <description>Data length = 1 byte</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2</name>
                                    <description>Data length = 2 bytes</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3</name>
                                    <description>Data length = 3 bytes</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4</name>
                                    <description>Data length = 4 bytes</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5</name>
                                    <description>Data length = 5 bytes</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6</name>
                                    <description>Data length = 6 bytes</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7</name>
                                    <description>Data length = 7 bytes</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Data length = 8 bytes</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D0</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x206</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA0</name>
                            <description>Data Bytes 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D1</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x207</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>Data Bytes 1</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D2</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x208</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA2</name>
                            <description>Data Bytes 2</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D3</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x209</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>Data Bytes 3</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D4</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA4</name>
                            <description>Data Bytes 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D5</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA5</name>
                            <description>Data Bytes 5</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D6</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA6</name>
                            <description>Data Bytes 6</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_D7</name>
                    <description>Mailbox Data Register %s</description>
                    <addressOffset>0x20D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>Data Bytes 7</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-31</dimIndex>
                    <name>MB%s_TS</name>
                    <description>Mailbox Time Stamp Register %s</description>
                    <addressOffset>0x20E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>TSL</name>
                            <description>Time Stamp Lower Byte</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSH</name>
                            <description>Time Stamp Higher Byte</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>MKR[%s]</name>
                    <description>Mask Register %s</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>Extended ID</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not compare associated EID[17:0] bits</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Compare associated EID[17:0] bits</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>Standard ID</description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not compare associated SID[10:0] bits</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Compare associated SID[10:0] bits</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>FIDCR%s</name>
                    <description>FIFO Received ID Compare Register %s</description>
                    <addressOffset>0x420</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>EID</name>
                            <description>Extended ID of data and remote frames</description>
                            <lsb>0</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SID</name>
                            <description>Standard ID of data and remote frames</description>
                            <lsb>18</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>Remote Transmission Request</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>ID Extension</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Standard ID</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extended ID</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
