cmsis-svd/cmsis-svd/data/Renesas/R7FA4E10D.svd
                <register>
                    <name>SFMCST</name>
                    <description>Communication Status Register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>COMBSY</name>
                            <description>SPI bus cycle completion state in direct communication</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No serial transfer being processed</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Serial transfer being processed</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EROMR</name>
                            <description>ROM access detection status in direct communication mode</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ROM access not detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ROM access detected</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSIC</name>
                    <description>Instruction Code Register</description>
                    <addressOffset>0x020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SFMCIC</name>
                            <description>Serial flash instruction code to substitute</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSAC</name>
                    <description>Address Mode Control Register</description>
                    <addressOffset>0x024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SFMAS</name>
                            <description>Number of address bytes select for the serial interface</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1 byte</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>2 bytes</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>3 bytes</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>4 bytes</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFM4BC</name>
                            <description>Selection of instruction code automatically generated when the serial interface address width is 4 bytes</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not use 4-byte address read instruction code</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Use 4-byte address read instruction code</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSDC</name>
                    <description>Dummy Cycle Control Register</description>
                    <addressOffset>0x028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000ff00</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SFMDN</name>
                            <description>Number of dummy cycles select for Fast Read instructions</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Default dummy cycles for each instruction: - Fast Read Quad I/O: 6 QSPCLK - Fast Read Quad Output: 8 QSPCLK - Fast Read Dual I/O: 4 QSPCLK - Fast Read Dual Output: 8 QSPCLK - Fast Read: 8 QSPCLK </description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1</name>
                                    <description>3 QSPCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2</name>
                                    <description>4 QSPCLK</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3</name>
                                    <description>5 QSPCLK</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4</name>
                                    <description>6 QSPCLK</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5</name>
                                    <description>7 QSPCLK</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6</name>
                                    <description>8 QSPCLK</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7</name>
                                    <description>9 QSPCLK</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8</name>
                                    <description>10 QSPCLK</description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9</name>
                                    <description>11 QSPCLK</description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xA</name>
                                    <description>12 QSPCLK</description>
                                    <value>0xa</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xB</name>
                                    <description>13 QSPCLK</description>
                                    <value>0xb</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xC</name>
                                    <description>14 QSPCLK</description>
                                    <value>0xc</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xD</name>
                                    <description>15 QSPCLK</description>
                                    <value>0xd</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xE</name>
                                    <description>16 QSPCLK</description>
                                    <value>0xe</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xF</name>
                                    <description>17 QSPCLK</description>
                                    <value>0xf</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMXST</name>
                            <description>XIP mode status</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal (non-XIP) mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>XIP mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMXEN</name>
                            <description>XIP mode permission</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Prohibit XIP mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Permit XIP mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMXD</name>
                            <description>Mode data for serial flash (Controls XIP mode.)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSPC</name>
                    <description>SPI Protocol Control Register</description>
                    <addressOffset>0x030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000010</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SFMSPI</name>
                            <description>SPI protocol select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Single SPI Protocol, Extended SPI protocol</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Dual SPI protocol</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Quad SPI protocol</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMSDE</name>
                            <description>QSPCLK extended selection bit when switching I/O of QIOn pin</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No QSPCLK extension</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>QSPCLK expansion when switching I/O direction of QIOn pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMPMD</name>
                    <description>Port Control Register</description>
                    <addressOffset>0x034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SFMWPL</name>
                            <description>WP pin level specification</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low level</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>High level</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCNT1</name>
                    <description>External QSPI Address Register</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>QSPI_EXT</name>
                            <description>Bank switching address</description>
                            <lsb>26</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>